In [1]:
import numpy as np
import pandas as pd

In [2]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}

In [3]:
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [4]:
one =pd.DataFrame(data_one)

In [6]:
two=pd.DataFrame(data_two)

In [7]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [9]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [10]:
pd.concat([one,two],axis =1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [11]:
pd.concat([one,two],axis =0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [13]:
two.columns = one.columns
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [14]:
pd.concat([one,two],axis = 0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [15]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})

In [16]:
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [17]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [19]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [20]:
pd.merge(registrations,logins,how = 'inner',on ='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [22]:
pd.merge(registrations,logins,how = 'left',on ='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [24]:
pd.merge(registrations,logins,how = 'right',on ='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [25]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [26]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [28]:
pd.merge(registrations,logins,how='outer',on = 'name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [ ]:
registrations = registrations.set_index('name')

In [41]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [43]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [45]:
pd.merge(registrations,logins,left_index=True,right_on = 'name',how='inner')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [46]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [60]:
registrations=registrations.reset_index('name')

In [62]:
registrations

     name  reg_id
0  Andrew       1
1    Bobo       2
2  Claire       3
3   David       4

In [65]:
registrations.columns=['reg_name','reg_id']

In [67]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [68]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [71]:
pd.merge(registrations,logins,left_on='reg_name',right_on = 'name',how = 'inner')

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [77]:
registrations.columns=['name','id']

In [80]:
registrations

  reg_name  id
0   Andrew   1
1     Bobo   2
2   Claire   3
3    David   4

In [74]:
logins.columns=['id','name']

In [75]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [81]:
registrations.columns=['name','id']

In [82]:
registrations

     name  id
0  Andrew   1
1    Bobo   2
2  Claire   3
3   David   4

In [83]:
logins

   id     name
0   1   Xavier
1   2   Andrew
2   3  Yolanda
3   4     Bobo

In [84]:
pd.merge(registrations,logins,how='inner',on = 'name')

     name  id_x  id_y
0  Andrew     1     2
1    Bobo     2     4

In [86]:
pd.merge(registrations,logins,how='inner',on = 'name',suffixes=('_reg','_log'))

     name  id_reg  id_log
0  Andrew       1       2
1    Bobo       2       4

STRING METHOD

In [90]:
gmail ='faisal@gamail.com'
gmail.split('@')

['faisal', 'gamail.com']

In [125]:
names =pd.Series(['andrew','bobo','claire','david','5'])

In [95]:
names

0    andrew
1      bobo
2    claire
3     david
4         5
dtype: object

In [97]:
names.str.upper()

0    ANDREW
1      BOBO
2    CLAIRE
3     DAVID
4         5
dtype: object

In [99]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [101]:
names.str.isalpha()

0     True
1     True
2     True
3     True
4    False
dtype: bool

In [102]:
tech_finance = ['GOOG,APPL,AMZN','JP,BAC,GS']

In [104]:
ticker =pd.Series(tech_finance)

In [105]:
ticker

0    GOOG,APPL,AMZN
1         JP,BAC,GS
dtype: object

In [108]:
 ticker.str.split(',')

0    [GOOG, APPL, AMZN]
1         [JP, BAC, GS]
dtype: object

In [109]:
tech ='GOOG,APPL,AMZN'

In [112]:
tech.split(',')[0]

'GOOG'

In [114]:
 ticker.str.split(',').str[0]

0    GOOG
1      JP
dtype: object

In [116]:
 ticker.str.split(',',expand=True)

      0     1     2
0  GOOG  APPL  AMZN
1    JP   BAC    GS

In [117]:
sport = ['chelsea,real madrid,machester,','man city,arsenal,tottenhamm','espanol,villereal,atl madrid']

In [118]:
teams=pd.Series(sport)

In [119]:
sport

['chelsea,real madrid,machester,',
 'man city,arsenal,tottenhamm',
 'espanol,villereal,atl madrid']

In [126]:
teams.str.split(',',expand = True)

          0            1           2     3
0   chelsea  real madrid   machester
1  man city      arsenal  tottenhamm  None
2   espanol    villereal  atl madrid  None

In [127]:
names =pd.Series(['andrew  ','bo;bo','  claire'  ,])

In [128]:
names

0    andrew
1       bo;bo
2      claire
dtype: object

In [134]:
names.str.replace(';','').str.strip().str.capitalize()

0    Andrew
1      Bobo
2    Claire
dtype: object

In [135]:
def cleenup(name):
    name = name.replace(';','')
    name =name.strip()
    name =name.capitalize()
    return name

In [136]:
names.apply(cleenup)

0    Andrew
1      Bobo
2    Claire
dtype: object